app/Models/Tabla_usuarios.php

SELECT *
FROM `usuarios`
WHERE `estatus_usuario` = 1
---
        public function getUsuariosActivos()
        {
            // Devuelve todos los usuarios con estatus 1
            return $this->table($this->table)
                        ->where('estatus_usuario', 1)
                        ->findAll();

SELECT *
FROM `usuarios`
WHERE `estatus_usuario` = -1
---
        public function getUsuariosInactivos()
        {
            // Filtra por estatus inactivo (-1)
            return $this->table($this->table)
                        ->where('estatus_usuario', -1)
                        ->findAll();